Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-26-37.tmx
Source language: bo
Languages: en

source: ངུ་ཞིང་། དགེ་བའི་བཤེས་གཉེན་བལྟ་བས་མ་ངོམས་བཞིན་དུ་མཉན་པ་དཔའ་བོའི་དྲུང་ནས་སོང་ངོ་།། །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། །བམ་པོ་བཞི་བ།
en: Jayottama

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བྱམས་པ་ཆེན་པོས་སེམས་ཅན་གྱི་ཁམས་ཚད་མེད་པར་རྒྱས་བའི་སེམས་དང་ལྡན་པ།
en: Then Sudhana, the head merchant’s son, whose mind spread great love throughout the immeasurable realm of beings;

source: སྙིང་རྗེ་ཆེན་པོའི་རླན་གྱིས་མངོན་པར་བརླན་པའི་རྒྱུད་ཅན།
en: whose being was saturated with the tenderness of great compassion;

source: བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་རྒྱ་ཆེན་པོའི་རྒྱན་ཤིན་ཏུ་བསྩགས་པ་ཉོན་མོངས་པའི་རྡུལ་དང་མུན་པ་དང་དྲི་མ་དང་འདམ་ཐམས་ཅད་དང་བྲལ་བ།
en: who had accumulated a vast array of the accumulations of merit and wisdom; who had become free of all the dust, darkness, dirt, and mire of the kleśas;

source: ཆོས་མཉམ་པ་ཉིད་ཁོང་དུ་ཆུད་པས།
en: who had realized the equality of all phenomena;

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ལམ་གྱེན་ཐུར་མེད་པ་ལ་ཞུགས་པ།
en: who was devoted to the path that leads upward to omniscience;

source: དགེ་བའི་ཆོས་ཚད་མེད་པ་ལ་འཇུག་པའི་སྒོར་ཞུགས་པ།
en: who had chosen the gateway for entering into immeasurable good qualities;

source: མི་དགེ་བ་ཐམས་ཅད་ཀྱིས་མི་ཤིགས་པའི་བརྩོན་འགྲུས་བརྟན་པའི་མཐུ་སྔོན་དུ་འདོར་བ་དང་ལྡན་པ།
en: who had the exertion of firm diligence that is unimpaired by any bad quality;

source: བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་བསམ་གྱིས་མི་ཁྱབ་པ་རབ་ཏུ་བྱང་བ། རྒྱ་ཆེན་པོའི་བདེ་བ་རབ་ཏུ་ཐོབ་པ།
en: who was filled with the vast calmness of inconceivable bodhisattva samādhis;

source: ཤེས་རབ་ཀྱི་ཉི་མའི་འོད་ཟེར་སྣང་བས། མ་རིག་པའི་མུན་པ་མ་ལུས་པ་བསལ་བ།
en: who shone with the light of the sun of wisdom that eliminated all the darkness of ignorance;

source: ཐབས་ཀྱི་སེར་བུ་བདེ་ཞིང་བསིལ་བས་བླགས་པའི་ཡེ་ཤེས་ཀྱི་མེ་ཏོག་གིས་རྒྱས་པ།
en: who scattered flowers of wisdom brought by the pleasant, cool breezes of methods;

source: སྨོན་ལམ་ཆེན་པོའི་རྒྱ་མཚོར་འབྱུང་བའི་ཡེ་ཤེས་ཀྱི་ཚུལ་དང་མཐུན་པ།
en: who followed the way of wisdom that emerged from an ocean of great aspirations;

source: ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་ཐོགས་པ་མེད་པར་རྒྱས་པར་འགེངས་པའི་ཡེ་ཤེས་དང་ལྡན་པ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཕོ་བྲང་དུ་ཐོགས་པ་མེད་པར་འགྲོ་བ་ལ་མངོན་དུ་གྱུར་པ། བྱང་ཆུབ་སེམས་དཔའི་ལམ་ལ་མངོན་པར་མོས་པ་དེ།
en: and who possessed the wisdom that permeated without impediment the entire realm of the Dharma—he had approached entry into the city of faultless omniscience, and he yearned for the bodhisattva path.

source: གྲོང་ཁྱེར་དགའ་བའི་ཕྲེང་བ་གང་ན་བ་དེར་ཕྱིན་ཏེ། ཚོང་དཔོན་རྒྱལ་བ་དམ་པ་ཡོངས་སུ་རྨེད་ཅིང་ཚོལ་ཚོལ་བ་ལས།
en: He arrived at the town called Nandihāra and looked and searched for the head merchant Jayottama.

source: གྲོང་ཁྱེར་དགའ་བའི་ཕྲེང་བའི་ཤར་ཕྱོགས་ལོགས་ཀྱི་འདབ་ཅིག་ན།
en: He saw him on the eastern edge of the town of Nandihāra, in a forest of ashoka trees that was called Vicitra­dhvaja.

source: ཤིང་ཨ་ཤོ་ཀའི་ནགས་ཚལ་རྒྱལ་མཚན་སྣ་ཚོགས་ཞེས་བྱ་བ་འདུག་པ་དེའི་ནང་ན་ཁྱིམ་བདག་སྟོང་ཕྲག་དུ་མ་ཞིག་གིས་བསྐོར་ཏེ།
en: He was encircled by many thousands of householders deciding upon various kinds of civic duties, and in reference to those he talked about the Dharma. He was teaching the Dharma for the sake of eliminating all egotism; abandoning all possessiveness; rejecting all attachment;

source: གྲོང་ཁྱེར་གྱི་བྱ་བ་སྣ་ཚོགས་ཡོངས་སུ་འགྲོ་ཞིང་དེ་ལས་བརྟེན་ཏེ།
en: forsaking all fixation on things; destroying all clinging;

source: བདག་ཏུ་བྱ་བ་ཐམས་ཅད་ཡང་དག་པར་གཞོམ་པ་དང་། ཡོངས་སུ་འཛིན་པ་ཐམས་ཅད་ཡོངས་སུ་གཏང་བ་དང་། དངོས་པོར་འཛིན་པ་ཐམས་ཅད་རབ་ཏུ་སྤང་བ་དང་། མངོན་པར་ཞེན་པ་ཐམས་ཅད་ཤིན་ཏུ་གཞིག་པ་དང་། སྲེད་པའི་འཆིང་བ་ཐམས་ཅད་གཅད་པར་བྱ་བ་དང་། ལྟ་བའི་རྣམ་པ་ཐམས་ཅད་ཀྱི་སྒོ་གླེགས་གཅག་པ་དང་། ཐེ་ཙོམ་དང་ཡིད་གཉིས་དང་། ནེམ་ནུར་གྱི་རབ་རིབ་ཐམས་ཅད་རྣམ་པར་བསལ་བ་དང་། གཡོ་སྒྱུའི་རྙོག་པ་ཤིན་ཏུ་གདང་བ་དང་། ཕྲག་དོག་དང་སེར་སྣའི་དྲི་མ་ཡོངས་སུ་སྦྱང་བ་དང་། སེམས་ཀྱི་མཚོ་ཤིན་ཏུ་གསལ་བར་བྱ་བ་དང་། སེམས་རྙོག་པ་མེད་པ་ལ་སེམས་ཅན་རབ་ཏུ་དགོད་པ་དང་། དད་པ་རྙོག་པ་མེད་པའི་སྟོབས་བསྐྱེད་དེ།
en: cutting through all the bondage of craving; breaking down the doors of all views; clearing away the darkness of doubt, uncertainty, and equivocation; cleansing away the dirt of illusion and deceit; purifying the stains of envy and miserliness; clarifying the lake of the mind; bringing beings to a state of unpolluted mentality; giving rise to an unpolluted faith;

source: སངས་རྒྱས་བལྟ་བར་མོས་པ་བསྐྱེད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྟོབས་བསྔགས་ཤིང་།
en: giving rise to the aspiration to see the buddhas; eulogizing the power of bodhisattvas;

source: སངས་རྒྱས་ཀྱི་ཆོས་ཡང་དག་པར་བླང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྨོས་ཏེ།
en: receiving the Dharma of the buddhas; aspiring to bodhisattva conduct;

source: བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་སྟོབས་ཡོངས་སུ་བསྐྱེད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཤེས་རབ་ཀྱི་སྟོབས་ཡང་དག་པར་སྟོན་ཅིང་།
en: giving rise to the power of bodhisattva samādhi; teaching the power of bodhisattva wisdom;

source: བྱང་ཆུབ་སེམས་དཔའི་དྲན་པའི་སྟོབས་རྣམ་པར་དག་པའི་མཐར་ཕྱིན་པར་བྱ་བའི་ཕྱིར།
en: and attaining the highest purity of the power of bodhisattva memory.

source: ཆོས་ཀྱི་གཏམ་བྱེད་ཅིང་འདི་ལྟ་སྟེ། བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ལ་མངོན་པར་མོས་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཅིང་འདུག་པ་མཐོང་ངོ་།
en: This means that he was teaching the Dharma in order to inspire the aspiration to enlightenment.

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་གཏམ་དེའི་རྗེས་ཆད་ཆད་དུ་བསྡད་ནས་ཚོང་དཔོན་རྒྱལ་བ་དམ་པའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Then when the teaching was concluded, Sudhana, the head merchant’s son, approached and bowed his head to the feet of the head merchant Jayottama.

source: རིང་མོ་ཞིག་ཏུ་བཏུད་ནས་ཆོས་ལ་ཤིན་ཏུ་གུས་པའི་བསམ་པས་ཚིག་འདི་སྐད་དུ་བརྗོད་དོ།
en: He bowed down to him for a long time and said, “Ārya, I am Sudhana, I am Sudhana! I seek bodhisattva conduct.

source: །འཕགས་པ་བདག་ནི་ནོར་བཟངས་ནོར་བཟངས་ཤེས་བགྱི་བ་སྟེ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་ཚོལ་ན་ཅི་ནས་ཀྱང་བདག་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་སློབ་པར་འགྱུར་བ་དང་། བསླབས་ནས་ཀྱང་ཅི་ནས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བགྱི་བ་དང་། གདུལ་བའི་དོན་ལ་མངོན་དུ་མོས་པར་འགྱུར་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཞལ་བལྟ་བ་ལས་མི་འཕང་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཐོས་པར་འགྱུར་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་ཡོངས་སུ་གཟུང་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་ཚུལ་ལ་ནན་ཏན་དུ་བགྱི་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྤྱད་པ་དང་། བསྐལ་པ་ཐམས་ཅད་དུ་གནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པས་ཡོངས་སུ་མི་སྐྱོ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ཡོངས་སུ་བཙལ་བར་འགྱུར་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་བྱིན་གྱི་རླབས་ཡང་དག་པར་མནོད་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྟོབས་རྣམས་ལ་སྣང་བ་ཐོབ་པར་འགྱུར་བ་དེ་ལྟར་འཕགས་པས་བདག་ལ་བཤད་དུ་གསོལ། །དེ་ནས་ཚོང་དཔོན་རྒྱལ་བ་དམ་པས།
en: Instruct me, Ārya, on how I should train in bodhisattva conduct and while training how I should aspire to guide and ripen all beings, not forsake seeing all the buddhas, hear the Dharma of all the buddhas, possess the rain from the clouds of the Dharma of all the buddhas, practice in the way of all the buddhas, practice bodhisattva conduct in all world realms, never tire of bodhisattva conduct while dwelling in all kalpas, comprehend the manifestations of all the tathāgatas, receive the blessing of all the buddhas, and attain splendor in the power of all the tathāgatas.”

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁྱོད་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ལེགས་སོ་ལེགས་སོ། །རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་འདི་ལྟ་སྟེ།
en: Then the head merchant Jayottama said to Sudhana, the head merchant’s son, “Noble one, it is excellent, excellent, that you have developed the aspiration for the highest, complete enlightenment.

source: དངོས་པོ་མེད་པ་ལ་གནས་པས་མངོན་པར་འདུ་བྱ་བ་མེད་པའི་རྫུ་འཕྲུལ་ཐོབ་པའི་མཐུས། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་སྒོ་ཐམས་ཅད་དུ་འགྲོ་བ་ཡོངས་སུ་སྦྱོང་སྟེ།
en: “Noble one, I purify the gateway to omnipresent bodhisattva conduct through the power of the attainment of noncomposite miracles while residing in the absence of existence.

source: དེ་ལྟར་ཁོ་བོ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་དག་པའི་སྒོ་ཐམས་ཅད་དུ་འགྲོ་བ་འདི་ལ་གནས་ཤིང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷའི་འཇིག་རྟེན་ཐམས་ཅད་དང་། མཚེ་མའི་ལྷའི་གནས་ཐམས་ཅད་དང་། དགའ་ལྡན་གྱི་ལྷའི་འཇིག་རྟེན་ཐམས་ཅད་དང་། འཕྲུལ་དགའི་ལྷའི་འཇིག་རྟེན་ཐམས་ཅད་དང་། གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷའི་འཇིག་རྟེན་ཐམས་ཅད་དང་། བདུད་ཀྱི་གནས་ཐམས་ཅད་དང་། འདོད་པའི་ཁམས་ཀྱི་ལྷའི་རིས་སུ་གཏོགས་པ་ཐམས་ཅད་དང་། ལྷའི་གནས་ཐམས་ཅད་དང་། ཀླུའི་འཇིག་རྟེན་ཐམས་ཅད་དང་། ཀླུའི་གནས་ཐམས་ཅད་དང་། གནོད་སྦྱིན་གྱི་འཇིག་རྟེན་ཐམས་ཅད་དང་། གནོད་སྦྱིན་གྱི་གནས་ཐམས་ཅད་དང་། སྲིན་པོའི་འཇིག་རྟེན་ཐམས་ཅད་དང་། སྲིན་པོའི་གནས་ཐམས་ཅད་དང་། གྲུལ་བུམ་གྱི་འཇིག་རྟེན་ཐམས་ཅད་དང་། གྲུལ་བུམ་གྱི་གནས་ཐམས་ཅད་དང་། ཡི་དགས་ཀྱི་འཇིག་རྟེན་ཐམས་ཅད་དང་། ཡི་དགས་ཀྱི་གནས་ཐམས་ཅད་དང་། དྲི་ཟའི་འཇིག་རྟེན་ཐམས་ཅད་དང་། དྲི་ཟའི་གནས་ཐམས་ཅད་དང་། ལྷ་མ་ཡིན་གྱི་འཇིག་རྟེན་ཐམས་ཅད་དང་། ལྷ་མ་ཡིན་གྱི་གནས་ཐམས་ཅད་དང་། ནམ་མཁའ་ལྡིང་གི་འཇིག་རྟེན་ཐམས་ཅད་དང་། ནམ་མཁའ་ལྡིང་གི་གནས་ཐམས་ཅད་དང་། མིའམ་ཅིའི་འཇིག་རྟེན་ཐམས་ཅད་དང་། མིའམ་ཅིའི་གནས་ཐམས་ཅད་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་འཇིག་རྟེན་ཐམས་ཅད་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་གནས་ཐམས་ཅད་དང་། མིའི་འཇིག་རྟེན་ཐམས་ཅད་དང་། མིའི་གནས་ཐམས་ཅད་དང་། གྲོང་དང་གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཁམས་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་དང་འདོད་པའི་ཁམས་སུ་གཏོགས་པའི་སེམས་ཅན་གྱི་རྒྱུད་ཐམས་ཅད་དུ་ཆོས་ནི་སྟོན་ཏོ། །ཆོས་མ་ཡིན་པ་ནི་བཟློག་གོ །རྩོད་པ་ནི་ཞི་བར་བྱེད་དོ། །འཐབ་པ་ནི་རྣམ་པར་བཟློག་གོ །འཁྲུག་པ་ནི་ཉེ་བར་ཞི་བར་བྱེད་དོ། །གཡུལ་དུ་ལྷགས་པ་ནི་རྣམ་པར་བཟློག་གོ །ཤགས་འགྱེད་པ་ནི་ཞི་བར་བྱེད་དོ། །མདུད་པར་འཛིན་པ་ནི་རབ་ཏུ་སེལ་ཏོ།
en: In that way, remaining in this gateway to omnipresent bodhisattva conduct, in all billion-world universes, in all the Trāyastriṃśa paradises, in all the Yāma paradises, in all the Tuṣita paradises, in all the Nirmāṇarati paradises, in all the Para­nirmita­vaśa­vartin paradises, in all the abodes of the māras, in all the places that are classed as paradises within all desire realms, in all the nāga worlds, in all the nāga abodes, in all the yakṣa worlds, in all the yakṣa abodes, in all the rākṣasa worlds, in all the rākṣasa abodes, in all the kumbhāṇḍa worlds, in all the kumbhāṇḍa abodes, in all the preta worlds, in all the preta abodes, in all the gandharva worlds, in all the gandharva abodes, in all the asura worlds, in all the asura abodes, in all the garuḍa worlds, in all the garuḍa abodes, in all the kinnara worlds, in all the kinnara abodes, in all the mahoraga worlds, in all the mahoraga abodes, in all the human worlds, in all the human abodes, villages, towns, market towns, districts, countries, and capitals, and for all classes of beings that are within all desire realms I teach the Dharma, reject all that is not Dharma, pacify all disputes, dispel all conflict, pacify all quarrels, prevent all battles, pacify wars, pacify hostility, cut through all bondage, break open all prisons, dispel all fear, and end the practice of nonvirtuous activities.

source: བཅིངས་པ་ཐམས་ཅད་ནི་ཡོངས་སུ་གཅོད་དོ། །བཙོན་ར་ཐམས་ཅད་ནི་མངོན་པར་འདྲལ་ལོ། །འཇིགས་པ་ནི་རྣམ་པར་བཟློག་གོ །མི་དགེ་བའི་ལས་ཀྱི་འདུ་བྱེད་ནི་རྒྱུན་གཅོད་དོ། །སྲོག་གཅོད་པ་ལས་ནི་སེམས་ཅན་རྣམས་རྣམ་པར་ཟློག་གོ །མ་བྱིན་པར་ལེན་པ་དང་འདོད་པས་ལོག་པར་གཡེམ་པ་དང་། བརྫུན་དུ་སྨྲ་བ་དང་ཕྲ་མ་དང་ཞེ་གཅོད་པ་དང་། ཚིག་ཀྱལ་པ་དང་ཆགས་སེམས་དང་། གནོད་སེམས་དང་ལོག་པར་ལྟ་བ་ལས་ནི་སེམས་ཅན་རྣམ་པར་ཟློག་གོ །མི་བྱ་བ་ཐམས་ཅད་ནི་བྱེད་དུ་མི་འཛུད་དོ།
en: I turn beings away from killing and from taking what is not given, sexual misconduct, telling lies, slandering, harsh speech, idle speech, avariciousness, maliciousness, and wrong views.

source: །དགེ་བའི་ཆོས་བྱ་བ་ཐམས་ཅད་ནི་བྱེད་དུ་འཛུད་དོ། །སེམས་ཅན་ཐམས་ཅད་ནི་བཟོ་ཐམས་ཅད་ལ་སློབ་ཏུ་འཛུད་དེ།
en: I turn beings away from all that should not be done and make them engage in all virtuous Dharma activity, and I make all beings train in all skills.

source: འཇིག་རྟེན་རྣམས་རབ་ཏུ་དགའ་བར་བྱ་བ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། ཞགས་པ་འཐུབ་པ་ཐམས་ཅད་ལ་གོང་མའི་ཡེ་ཤེས་ཁྱད་པར་དུ་འཕགས་པ་བརྗོད་པའི་ཕྱིར་རྗེས་སུ་འབྲང་བར་བྱ་བ་དང་། ལྟ་བའི་རྣམ་པ་ཐམས་ཅད་རྣམ་པར་བཟློག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་བརྗོད་ཅིང་བསྟན་པའི་ཕྱིར་འཇིག་རྟེན་ལ་ཕན་པར་འགྱུར་བའི་གཙུག་ལག་ཐམས་ཅད་ཀྱང་སྟོན་ཏོ། །རྣམ་པར་འགོད་དོ། །རབ་ཏུ་གསལ་བར་བྱེད་དོ། །བརྗོད་དོ།
en: I teach, prepare, elucidate, and present all the treatises that are beneficial to the world, so as to bring happiness to the world, to ripen beings, to follow false doctrines in order to describe the special higher wisdom, to dispel all wrong views, and to describe and teach all the Buddhadharma.

source: །དེ་བཞིན་དུ་ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་གཟུགས་ཀྱི་ཁམས་ཀྱི་ལྷ་ཐམས་ཅད་ཟིལ་གྱིས་མནན་ཏེ་ཆོས་སྟོན་ཏོ།
en: I overwhelm and teach the Dharma to all the devas in the form realm as far up as the Brahmā paradise.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ཕྱོགས་བཅུར་ཡང་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དག་ཏུ་ཆོས་སྟོན་ཏེ།
en: “Just as I teach the Dharma in the world realms of this billion-world universe, I do so in world realms in the ten directions as numerous as the atoms in an indescribable quintillion buddha realms. I teach the Dharma of the buddhas.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཀྱང་སྟོན་ཏོ།
en: I teach the Dharma of the bodhisattvas.

source: །བྱང་ཆུབ་སེམས་དཔའི་ཆོས་དང་ཉན་ཐོས་ཀྱི་ཆོས་དང་རང་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱང་སྟོན་ཏོ།
en: I teach the Dharma of the śrāvakas and the Dharma of the pratyeka­buddhas.

source: སེམས་ཅན་དམྱལ་བ་ཡང་སྟོན་ཏོ།
en: I teach the hells.

source: སེམས་ཅན་དམྱལ་བར་འགྲོ་བའི་ལམ་དང་། སེམས་ཅན་དམྱལ་བ་པའི་སེམས་ཅན་གྱི་མི་བདེ་བའང་སྟོན་ཏོ།
en: I teach the path that leads to the hells. I teach the unhappiness of beings in the hells.

source: །བྱོལ་སོང་གི་སྐྱེ་གནས་ཀྱང་སྟོན་ཏོ།
en: I teach the animal existences.

source: །བྱོལ་སོང་གི་སྐྱེ་གནས་ཀྱི་ལམ་གྱི་རྒྱུད་ཐ་དད་པ་དང་། བྱོལ་སོང་གི་སྐྱེ་གནས་ཀྱི་ལམ་དུ་འགྲོ་བའི་ལམ་དང་། བྱོལ་སོང་གི་སྐྱེ་གནས་སུ་སྐྱེས་པའི་སྡུག་བསྔལ་ཡང་སྟོན་ཏོ།
en: I teach the different kinds of animal existences, the paths that lead to animal existences, and the suffering of animal existences.

source: །གཤིན་རྗེའི་འཇིག་རྟེན་ཡང་སྟོན་ཏོ།
en: I teach the world of Yama.

source: །གཤིན་རྗེའི་འཇིག་རྟེན་དུ་འགྲོ་བའི་ལམ་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་སྡུག་བསྔལ་ཡང་སྟོན་ཏོ།
en: I teach the path that leads to the world of Yama. I teach the suffering in the world of Yama.

source: །མཐོ་རིས་ཀྱི་འཇིག་རྟེན་ཡང་སྟོན་ཏོ།
en: I teach the higher existences.

source: །མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་འགྲོ་བའི་ལམ་དང་། མཐོ་རིས་ཀྱི་འཇིག་རྟེན་གྱི་དགའ་བ་སྤྱོད་པ་དང་། ལོངས་སྤྱོད་ཀྱང་སྟོན་ཏོ།
en: I teach the path that leads to the higher existences. I teach the practice and enjoyment of happiness in the higher existences.

source: །མིའི་འཇིག་རྟེན་ཡང་སྟོན་ཏོ།
en: I teach the human world.

source: །མྱིའི་འཇིག་རྟེན་གྱི་ལམ་གྱི་རྒྱུད་དུ་འགྲོ་བའི་ལམ་དང་མིའི་འཇིག་རྟེན་གྱི་བདེ་བ་དང་། སྡུག་བསྔལ་ཉམས་སུ་མྱོང་བ་སྣ་ཚོགས་ཀྱང་སྟོན་ཏེ།
en: I teach the path that leads to the human world. I teach the various experiences of happiness and suffering in the human world.

source: དེ་ལྟར་རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་འཇིག་རྟེན་གྱི་ཆོས་ཀྱང་སྟོན་ཏོ། །འཇིག་རྟེན་ཀུན་འབྱུང་བ་དང་། འཇིག་རྟེན་ནུབ་པར་འགྱུར་བ་དང་། འཇིག་རྟེན་གྱི་ཁ་ན་མ་ཐོ་བ་དང་། འཇིག་རྟེན་ནས་འབྱུང་པ་ཡང་སྟོན་ཏོ།
en: “In that way, noble one, I also teach the Dharma of the world, the creation of the world, the destruction of the world, the transgressions in the world, and the renunciation of the world.

source: །དེ་ཡང་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ལམ་ཡང་དག་པར་བསྟན་པ་དང་། འཁོར་བའི་སྐྱོན་རྣམ་པར་བཟློག་པ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡོན་ཏན་ཡང་དག་པར་བརྗོད་པ་དང་། སྲིད་པའི་ལམ་གྱི་རྒྱུད་དུ་མགོ་འཁོར་བ་དང་སྡུག་བསྔལ་དུ་གྱུར་པ་ཡང་དག་པར་སྟོན་པ་དང་། སྒྲིབ་པ་མེད་པའི་ཆོས་ཉིད་བརྗོད་པ་དང་། འཇིག་རྟེན་རྒྱུའི་བྱ་བ་ཡོངས་སུ་བསྟན་པ་དང་། འཇིག་རྟེན་འབྱུང་བ་དང་། ལྡོག་པའི་བདེ་བ་དང་། སྡུག་བསྔལ་ཐམས་ཅད་སྨོས་པ་དང་། འགྲོ་བ་ཐམས་ཅད་ཀྱི་གནས་ཀྱི་མིང་དུ་བྱ་བ་རྣམ་པར་བསྒོམ་པ་དང་། དེ་བཞིན་གཤེགས་པའི་ཆོས་གནས་པ་མེད་པ་མངོན་པར་བསྟན་པ་དང་། ལས་དང་ཉོན་མོངས་པའི་འཁོར་ལོ་ཐམས་ཅད་རྣམ་པར་བཟློག་པ་དང་། དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་འཁོར་ལོ་འཁོར་བ་ཤིན་ཏུ་བརྗོད་པའི་ཕྱིར་ཆོས་སྟོན་ཏོ།
en: “In this way, I teach the Dharma in order to explain the bodhisattva path, reject the faults of saṃsāra, teach the qualities of omniscience, pacify the delusion and sufferings of the existences, describe the unobscured true nature, illuminate the activities of being in the world, describe all the happiness and suffering of being in the world, contemplate the designations of the abodes of all beings, teach the tathāgata qualities that have no location, counter the wheel of all karma and kleśas, and describe the turning of the tathāgata’s wheel of the Dharma.

source: །རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྣམ་པར་དག་པའི་སྒོ་ཐམས་ཅད་དུ་འགྲོ་བ་དངོས་པོ་མེད་པ་ལ་གནས་པས་མངོན་པར་འདུ་བྱ་བ་མེད་པའི་རྫུ་འཕྲུལ་གྱི་མཐུས་བརྒྱན་པ་འདི་ཤེས་པར་ཟད་ན་ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་མངོན་པར་ཤེས་པ་ཞིང་གི་དབྱིངས་ཐམས་ཅད་དུ་སྒྱུ་མ་ལྟ་བུའི་ཡེ་ཤེས་ཀྱི་ལུས་ཀྱིས་རྒྱས་པར་འགེངས་པ་ཀུན་ཏུ་ལྟ་བའི་ཡེ་ཤེས་ཀྱིས་རབ་ཏུ་ཐོབ་པ་ཚིག་གི་ལམ་དང་། སྒྲ་ཐམས་ཅད་རྣམ་པར་དམྱིགས་པ་ལ་ཤིན་ཏུ་གཞོལ་བའི་རྣ་བ་དང་ལྡན་པ།
en: “Noble one, I know this gateway to pure, omnipresent bodhisattva conduct, the stainless display of the noncomposite miracles based in the absence of existence, but how could I know the conduct or describe the qualities of the bodhisattvas who know all; who fill the surfaces of all realms with illusory bodies of wisdom; who have attained the level of the complete eyes of wisdom;

source: དུས་གསུམ་རྒྱས་པར་འགེངས་པའི་ཆོས་ཀྱི་སྒོ་སྣང་བ་ལ་དབང་རབ་ཏུ་ཐོབ་པ།
en: who have the supreme hearing of the range of speech, sound, and communication; who have attained the power of the light of Dharma gateways that fill the three times;

source: ཆོས་ཐམས་ཅད་ལ་ཡང་དག་པར་གཞོལ་བའི་ཡེ་ཤེས་ལ་དབང་གིས་དབང་སྒྱུར་བའི་སྐྱེས་བུ་དཔའ་བོ་སེམས་ཅན་ཚད་མེད་བསམ་གྱིས་མི་ཁྱབ་པའི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྣམ་པར་དམྱིགས་པར་བྱ་བ་ལམ་འདྲེས་པའི་དབྱངས་ཀྱི་དཀྱིལ་འཁོར་དང་ལྡན་པའི་ལྕེ་ཡངས་ཤིང་སྲབ་ལ་ཡིད་དུ་འོང་བ་དང་ལྡན་པ།
en: who are heroic beings who have the mastery of the power of the wisdom that includes all phenomena; who possess beautiful, fine tongues that are endowed with a domain of speech that is directed separately, according to their aspirations, to inconceivable, immeasurable beings;

source: བསམ་པ་ཐ་དད་པའི་སེམས་ཅན་རྒྱ་མཚོའི་ཡིད་དུ་འོང་བའི་ཁ་དོག་དང་། དབྱིབས་སུ་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་མཉམ་པའི་ལུས་སྒྱུ་མ་ལྟ་བུ་དང་ལྡན་པ།
en: who have bodies that are like illusions and equal to all bodhisattvas, with complexions and forms that accord with the various wishes of an ocean of beings;

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དང་མི་གཉིས་པའི་སྤྱོད་ལམ་གྱིས། བསམ་གྱིས་མི་ཁྱབ་པའི་ལུས་ལ་གཞོལ་བ།
en: who possess inconceivable bodies that have a conduct no different from that of all the tathāgatas;

source: དུས་གསུམ་ཐམས་ཅད་དུ་རྗེས་སུ་འབྲང་བའི་ཡེ་ཤེས་ཀྱི་ལུས་དང་ལྡན་པ་ནམ་མཁའི་དབྱིངས་ལྟར་ཚད་མེད་པའི་སྤྱོད་ཡུལ་དཔག་ཏུ་མེད་པའི་ཡུལ་དང་ལྡན་པ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: who have bodies of wisdom that follow all three times; and who have a scope and field of conduct that is as immeasurable and vast as the expanse of space? “Depart, noble one.

source: ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན། །སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ཀྱི་ཡུལ་ཤུ་མ་ཕྱི་མའི་མཐའ་ན། གྲོང་ཁྱེར་ཀ་ལིང་གའི་ནགས་ཚལ་ཞེས་བྱ་བ་ཡོད་ཏེ། དེ་ན་དགེ་སློང་མ་སེང་གེ་རྣམ་པར་བསྒྱིངས་བ་ཞེས་བྱ་བ་འདུག་གིས།
en: In this southern region, in the land called Śroṇāparānta, there is a city by the name of Kaliṅgavana where dwells a bhikṣuṇī by the name of Siṃha­vijṛmbhitā.

source: དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཚོང་དཔོན་རྒྱལ་བ་དམ་པའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Go to her and ask her, ‘How should a bodhisattva train in bodhisattva conduct? How should a bodhisattva practice it?’

source: ཚོང་དཔོན་རྒྱལ་བ་དམ་པ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཡང་དང་ཡང་བལྟས་ཏེ། ཚོང་དཔོན་རྒྱལ་བ་དམ་པའི་དྲུང་ནས་སོང་ངོ་།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the head merchant Jayottama, circumambulated the head merchant Jayottama many hundreds of thousands of times, keeping him to his right, and, looking back again and again, departed from the head merchant Jayottama.

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་མཐར་གྱི་ཡུལ་ཤུ་མ་ཕྱི་མའི་མཐའི་གྲོང་ཁྱེར་ཀ་ལིང་གའི་ནགས་ཚལ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Siṃha­vijṛmbhitā Sudhana, the head merchant’s son, set out for the town of Kaliṅgavana in the land of Śroṇāparānta and then arrived there.

source: དགེ་སློང་མ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པ་ཡོངས་སུ་ཚོལ་ཞིང་སེམས་ཅན་ཀུན་ལ་རྨེད་པའི་ཚེ།
en: Searching for the bhikṣuṇī Siṃha­vijṛmbhitā, as he roamed here and there he questioned the people he met.

source: གང་ནས་གང་དུ་སོང་བ་དེ་དང་དེར་རོགས་པ་བརྒྱ་ཕྲག་དུ་མ་དང་། བུ་མོ་བརྒྱ་ཕྲག་དུ་མ་ཞིག་སྲང་དང་ལམ་གྱི་བཞི་མདོ་དང་། ལམ་གྱི་སུམ་མདོ་དག་ན་ཚོགས་ཏེ། རྗེས་སུ་འབྲང་ངོ་། །སྐྱེས་པ་བརྒྱ་ཕྲག་དུ་མ་དང་། བུད་མེད་བརྒྱ་ཕྲག་དུ་མ་ཞིག་གིས་ཀྱང་རིགས་ཀྱི་བུ་འདི་རེ་དགེ་སློང་མ་སེང་གེ་རྣམ་པར་བསྒྱིངས་པ་ནི།
en: There were many hundreds of young men and many hundreds of young women assembling and following in the streets, crossroads, and street junctions, together with many hundreds of men and many hundreds of women.

source: གྲོང་ཁྱེར་ཀ་ལིང་གའི་ནགས་ཚལ་འདི་ཉིད་ཀྱི་བཟའ་ཤིང་གི་ར་བ་ཆེན་པོ་རྒྱལ་བའི་འོད་ཀྱིས་བྱིན་པ་ཉི་མའི་མདོག་ན་སེམས་ཅན་ཚད་མེད་པའི་དོན་དུ་ཆོས་སྟོན་ཅིང་འདུག་གོ་ཞེས་བསྟན་ཏོ།
en: They said, “Noble one, the bhikṣuṇī Siṃha­vijṛmbhitā is in this town of Kaliṅgavana, sitting in the great park called Sūrya­prabha donated by Jayaprabha, where she is teaching the Dharma for the sake of countless beings.”

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བཟའ་ཤིང་གི་ར་བ་ཉི་མའི་མདོག་དེར་ཕྱིན་ནས་ཀུན་ཏུ་བཙལ་ཏེ།
en: Then Sudhana, the head merchant’s son, went to Sūrya­prabha Park.

source: བལྟས་ན་བཟའ་ཤིང་གི་ར་བ་དེ་ན། ཤིང་ཟླ་བ་ཤར་བ་ཞེས་བྱ་བ་ཁང་པ་བརྩེགས་པའི་དབྱིབས་ལྟར་འདུག་པ། འོད་སྣ་ཚོགས་ཀྱི་ཁ་དོག་ཅན་འོད་ཀྱི་མདོག་དང་ལྡན་པ། འཁོར་ཀུན་ཏུ་དཔག་ཚད་ཀྱི་ཁྱོན་ཙམ་དུ་འོད་ཀྱིས་རྒྱས་པར་འགེངས་པ་མང་པོ་དང་། ལོ་མའི་ཤིང་ཡོངས་སུ་འགེངས་པ་ཞེས་བྱ་བ་གདུགས་ཀྱི་རྣམ་པ་དང་དབྱིབས་སུ་འདུག་པའི་འདབ་མས་ཀུན་ནས་ཁེབས་པ།
en: Walking around it and looking about, he saw in the park many trees called candrodgata that had the shape of kūṭāgāras, had various colors of light, and shone with light, illuminating everywhere around up to a yojana.

source: བཻཌཱུརྱ་སྔོན་པོའི་ཁ་དོག་ལྟར་འདུག་པའི་སྤྲིན་གྱི་མདོག་དང་ལྡན་པ་མང་པོ་དང་མེ་ཏོག་གི་ཤིང་མེ་ཏོག་གི་མཛོད་ཅེས་བྱ་བ།
en: He saw many leafy trees called saṃpracchada that had the shape of a parasol, and their leaves covered everywhere, like shining clouds the color of blue beryl.

source: རིའི་རྒྱལ་པོ་ཁ་བ་ཅན་ལྟར་མདངས་དགའ་བའི་དབྱིབས་སྣ་ཚོགས་དང་ལྡན་པ་ཁ་དོག་སྣ་ཚོགས་ཀྱི་མེ་ཏོག་མི་ཟད་པའི་ཆར་རབ་ཏུ་འབེབས་པ།
en: He saw many blossoming trees called kusuma­kośa that had the varied beautiful shape of the Himalaya, king of mountains, and from which fell unceasing flows of a rain of flowers of various colors;

source: སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷའི་ཕོ་བྲང་གི་རྒྱན་གྱི་ཀུན་ནས་འདུ་བ་དང་། སུས་ཀྱང་མི་ཤིགས་པ་ལྟ་བུ་མང་པོ་དང་། ཤིང་ཏོག་གི་ཤིང་རྟག་ཏུ་སྨིན་པའི་རོ་དཔེ་མེད་པའི་འབྲས་བུའི་ཚོགས་ཤེས་བྱ་བ་གསེར་གྱི་རི་བོའི་ལྷུན་ལྟར་འདུག་པ།
en: they were an accumulation of all the adornments of the Trāyastriṃśa palace and could not be destroyed by anyone. He saw many fruit trees called anupama­svādu­phala­nicita , which had the form of gold mountain peaks and always had perfect fruit that was always ripe.

source: རྟག་ཏུ་ཤིང་ཏོག་ཕུན་སུམ་ཚོགས་པར་གནས་པ་མང་པོ་དང་། རིན་པོ་ཆེའི་རྒྱལ་པོའི་ཤིང་རྣམ་པར་སྣང་བའི་མཛོད་ཅེས་བྱ་བ་རིན་པོ་ཆེའི་རྒྱལ་པོ་དཔེ་མེད་པའི་དབྱིབས་ལྟར་འདུག་པ། ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་ཕྲེང་བ་དང་། སེ་མོ་དོ་དང་། རྒྱན་རིན་པོ་ཆེ་ཡིད་བཞིན་གྱི་རྒྱལ་པོའི་མཛོད་ནས་བྱུང་བ་ལྟར་ཕུན་སུམ་ཚོགས་པ་དང་ལྡན་པ།
en: He saw many trees of kings of jewels called vairocanakośa that had the shapes of incomparable kings of jewels and possessed perfect divine strings of jewels, necklaces, and precious adornments that seemed to have come from the treasury of the kings of wish-fulfilling jewels and were the source of jewels of countless colors.
